# Pandas: the basics

In [3]:
import pandas as pd

## Dataframes

In [4]:
# Load a CSV
data = pd.read_csv('../../data/Melbourne_Annual.csv')

In [9]:
# Print a concise summary
data.info()

data.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 166 entries, 0 to 165
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         166 non-null    int64
 1   Rainfall     166 non-null    float64
 2   Temperature  166 non-null    float64
dtypes: float64(2), int64(1)
memory usage: 4.0 KB

(166, 3)

In [ ]:
# Show the shape

In [10]:
# Show the first 5 rows
data.head()

   Year  Rainfall  Temperature
0  1855     541.9         17.3
1  1856     756.1         19.0
2  1857     734.6         19.8
3  1858     662.5         20.2
4  1859     556.3         19.4

In [12]:
# Show the first 10 rows
data.head(10)

   Year  Rainfall  Temperature
0  1855     541.9         17.3
1  1856     756.1         19.0
2  1857     734.6         19.8
3  1858     662.5         20.2
4  1859     556.3         19.4
5  1860     646.2         19.6
6  1861     741.8         19.4
7  1862     562.0         19.8
8  1863     926.4         19.3
9  1864     697.5         19.2

In [13]:
# Show the last 10 rows
data.tail(10)

     Year  Rainfall  Temperature
156  2011     832.4         20.8
157  2012     601.2         20.8
158  2013     641.0         21.4
159  2014     472.8         21.7
160  2015     439.2         20.4
161  2016     599.6         20.3
162  2017     602.0         20.9
163  2018     514.4         20.7
164  2019     374.4         20.8
165  2020     786.8         19.9

In [14]:
# Show missing values
bom = pd.read_excel('../../data/BOM_VIC_20210323.xlsx', sheet_name='Melbourne')

bom.isna()

       Station   Year  Month    Day  Rainfall  Maximum  Minimum
0        False  False  False  False      True     True     True
1        False  False  False  False      True     True     True
2        False  False  False  False      True     True     True
3        False  False  False  False      True     True     True
4        False  False  False  False      True     True     True
...        ...    ...    ...    ...       ...      ...      ...
60708    False  False  False  False     False    False    False
60709    False  False  False  False     False    False    False
60710    False  False  False  False     False    False    False
60711    False  False  False  False     False    False    False
60712    False  False  False  False     False    False    False

[60713 rows x 7 columns]

In [17]:
# Show a range of values
data[-20:-10]

     Year  Rainfall  Temperature
146  2001     605.2         20.5
147  2002     396.6         20.9
148  2003     493.0         20.7
149  2004     622.2         20.4
150  2005     590.0         21.4
151  2006     438.4         20.8
152  2007     448.4         21.8
153  2008     449.4         20.9
154  2009     464.8         21.6
155  2010     780.6         21.0

## Series

In [18]:
rainfall = bom['Rainfall']

In [19]:
rainfall[-82:]

60631     0.0
60632     0.0
60633    12.6
60634     2.6
60635    11.2
         ...
60708     0.0
60709     0.0
60710     1.2
60711     5.6
60712    13.8
Name: Rainfall, Length: 82, dtype: float64

In [22]:
# Fill missing values (returns a new Series)
rainfall.fillna(0.0)

0         0.0
1         0.0
2         0.0
3         0.0
4         0.0
         ...
60708     0.0
60709     0.0
60710     1.2
60711     5.6
60712    13.8
Name: Rainfall, Length: 60713, dtype: float64

In [28]:
# Show some stats

bom[['Year', 'Month', 'Rainfall']].max()

Year        2021.0
Month         12.0
Rainfall     113.4
dtype: float64